{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"config": {"embeddings_constraint": null, "dtype": "float32", "input_dim": 572, "output_dim": 100, "name": "embedding_2", "input_length": null, "embeddings_regularizer": null, "trainable": true, "mask_zero": false, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "batch_input_shape": [null, null], "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [5], "bias_constraint": null, "name": "conv1d_2", "strides": [1], "padding": "same", "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1], "activity_regularizer": null, "filters": 188, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 100, "stateful": false, "trainable": true, "dropout": 0.0, "unroll": false, "name": "lstm_2", "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 1, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"name": "time_distributed_2", "trainable": true, "layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_2", "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "units": 127, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "class_name": "Sequential"}